# Напишите программу, которая на вход
# принимает число и выдаёт его квадрат (число
# умноженное на само себя).

# number = int(input('Введите число:\n'))
# print(f'Квадрат числа {number} : {number*number}')

# 1. Напишите программу, которая на вход принимает два
# числа и проверяет, является ли второе число квадратом
# первого.
# a = 5; b = 25 -> да30
# a = 9; b = -3 -> нет
# a = -3 b = 0 -> нет

# number = int(input('Введите первое число:\n'))
# number2 = int(input('Введите второе число:\n'))
# if number2 == number**2:
#     print(f'Число {number2} является квадратом числа {number}')
# else:
#     print(f'Число {number2} НЕ является квадратом числа {number}')    

# 2. Организуйте последовательный ввод чисел до тех
# пор, пока не будет введён 0. Подсчитайте среди
# введённых чисел те, которые кратны трём.
# number = 1
# count = 0
# while number != 0:
#     number = int(input('Введите число: '))
#     if number > 0 and number % 3 == 0:
#         count += 1
# print(f'Количество чисел, кратных 3: {count}')        

